; This is the Czech language file for Open File shell for TC application, version 1.8b and 1.8c
; Information for translators.

; New lines (v1.8b -> v1.8c) are marked with the "; new" comments (above these lines),
; changed lines are marked with the "; changed" comment.
; Also, part of new strings is marked with the "; new (*)" symbols. While OpenFileTC
; wa in test, some translators have maked a temporary .lng-files. This mark show them
; all new strings. If you didn't make temp. translations, then do not make an attention on 
; this symbol - translate this string as new

; It's recommended to save this language file in Unicode. But if ANSI code works correctly
; in your country, then you can save language file in this code page.
;
; You can use "/s;" string (3 symbols, without quotes) to make a break in string.

; --------------------------------------------- ;
;						;
; Version 1.8c  				;
;         					;
;   No important changes                      	;
;						;
; --------------------------------------------- ;
 
[Misc]           ; info about author of this language file. Please fill all fields correctly and put here info only about YOU :)
 ; language name, must be in your native letters
0=Česky        
 ; name of translator (man or company)
1=jvh     
 ; supported OpenFileTC version
2=1.8c            
 ; your contact information and copyrights. Will be enable only here, don't be published in OpenFileTC 
3=Total Commander Forum - Slovak and Czech 
 ; OpenFileTC discussing forum in your native language (if it exists)
5=http://ghisler.ch/board/viewtopic.php?t=16582

[MainUnit]       ; strings and messages for main window
0=Otevřít soubor %FileName% ...
1=Preferované programy
2=Další programy
3=Klávesová zkratka
4=Nedostupné programy
5=Jiný program...
6=Vyberte program...
7=Zvolený soubor není spustitelná aplikace!/s;"%ProgramName%"./s;Typ souboru (přípona) není EXE./s;Opravdu chcete zvolit tento program?
8=Program:
9=Přípona:
10=Cesta:
11=Program nenalezen!
12=Upravit asociace
13=Změnit cestu k programu
14=Přejmenovat
15=Klávesová zkratka:
16=Odstranit ze seznamu
17=Přejmenování
18=Nový název:
19=Opravdu chcete odstranit program "%ProgramName%"/s;ze seznamu dostupných aplikací?
20=Upozornění: Byl nalezen program Total Commander./s;Můžete nastavit program "OpenFileTC" jako standardní editor./s;%NowStandProgram%/s;Výhody:/s;- každý soubor může být otevřen klávesou F4 ODPOVÍDAJÍCÍM editorem/s;- jednoduché nastavení asociací/s;- OpenFileTC není "vlezlý"/s;/s;Pokud chcete využívat tyto výhody stiskněte ANO./s;Program provede potřebná nastavení automaticky. /s;Tento dotaz se zobrazí pouze jednou.
21=Děkujeme za Váš výběr!/s;/s;Pokud máte právě spuštěn Total Commander (příp. další instance),/s;prosím restartujte jej (je). Změmy se projeví po opětovném spuštění Total Commanderu.
22=Upozornění: Byl nalezen program DbCD Universal./s;Můžete nastavit program "OpenFileTC" jako standardní prohlížeč./s;%NowStandProgram%/s;Výhody:/s;- každý soubor může být otevřen klávesou F3 ODPOVÍDAJÍCÍM prohlížečem/s;- jednoduché nastavení asociací/s;- OpenFileTC  není "vlezlý"/s;/s;Pokud chcete využívat tyto výhody stiskněte ANO./s;Program provede potřebná nastavení automaticky. /s;Tento dotaz se zobrazí pouze jednou.
23=Děkujeme za Váš výběr!/s;/s;Pokud máte právě spuštěn DbCD Universal (příp. další instance),/s;prosím restartujte jej (je). Změmy se projeví po opětovném spuštění DbCD Universalu.
24=Vybrat program, kterým bude otevřen/s;soubor %FileName%
25=Vždy použít vybraný program k otevření souboru tohoto typu
26=Nastavení %ProgramName%
27=Otevřít, ale nesledovat program
28=Otevřít v programu %ProgramName%
29=Počet spuštění:
30=Program byl spuštěn bez parametrů. Nedoporučuje se přidávat programy v tomto módu. Chcete přesto přidat novou položku do seznamu?
31=Nezobrazovat více okno výběru pro soubory %FileType%,/s;automaticky otevře soubor vybraným programem.
32=OK
33=Nastavení OpenFileTC
34=Storno
35=Seřadit
36=Zobrazit
37=Zobrazit ikony
38=Nastavení podmínek
39=Nyní je používán: "%ProgramName%"
40=Seznam všech programů
41=Editace programu/s;/s;Pokoušíte se editovat spustitelný soubor:/s;"%FileName%"      /s;Chcete přidat tento soubor do seznamu programů      /s;v hlavním okně OpenFileTC?/s;/s;Stiskněte ANO pro přidání do seznamu/s;Stiskněte NE pro editaci tohoto programu
42=Program bude zobrazen v okně
43=Nelze vytvořit skupinu pro položky programu. Jsou možné chyby v programu.   
44=Nelze vytvořit konfigurační soubor "%INIFileName%"./s;Pravděpodobně spouštíte program ze zařízení určeného pouze ke čtení (CD-ROM, DVD-ROM), nebo je konfigurační soubor chráněn proti zápisu./s;OpenFileTC uloží nastavení do složky "%WinFolder%"
45=Chyba při vytváření konfiguračního souboru./s;Soubor: "%INIFileName%"./s;Zpráva: "%SystemMessage%"./s;Chyba: "%ClassMessage%"./s;/s;Program bude ukončen.
46=Program otevře pouze první vybraný soubor,/s;bez použití uvozovek
47=Program otevře pouze první vybraný soubor,/s;s použitím uvozovek
48=Každý z vybraných souborů bude otevřen v samostatné /s;instanci programu, bez použití uvozovek
49=Každý z vybraných souborů bude otevřen v samostatné /s;instanci programu, s použitím uvozovek
50=Okno programu bude minimalizováno
51=Přidat program, kterým lze otevřít/s;soubor vybraného typu
52=Okno programu bude maximalizováno
53=Skrýt nástrojovou lištu
54=Přidat nový program
55=Nastavení programu
56=Odstranit program ze seznamu
57=Nastavení OpenFileTC
58=Přidat příponu "%type%" mezi podporované
59=Odstranit příponu "%type%" z podporovaných
60=OpenFileTC má od verze 1.8b schopnost rozpoznávat aplikace a nastavit jim potřebný typ spouštění./s;Tím je odstraněna stará chyba, při které zůstávaly některé programy v paměti RAM, jestliže byly spuštěny přes OpenFileTC.  /s;/s;OpenFileTC může nyní zkontrolovat Vaše aplikace, přejete si provést kontrolu? /s;/s;ANO - provede kontrolu a potřebné změny/s;NE - nebudou provedeny žádné změny/s;STORNO - zeptá se na kontrolu později
61=Notepad
62=OpenFileTC nenůže vytvořit složku s konfiguračním souborem,/s;který byl specifikován v příkazovém řádku:/s;/s;   %OriginalINI%/s;/s;OpenFileTC použije standardní konfigurační soubor:/s;/s;   %BasicINI%
 ; new
63=Skrýt nástrojovou lištu
 ; new
64=Zobrazit nástrojovou lištu

[EditExtsUnit]   ; here strings and messages for extensions tuner window
0=Editace přípon pro program "%ProgramName%"
1=OK
2=Storno
3=Přidat
4=Editovat
5=Odstranit
6=Nová přípona
7=Přípona:
8=Otevřít v programu %ProgramName%
9=Otevřít "applications' selection window"
10=Akce OpenFileTC
11=Přípona
12=Příkazový řádek
13=Dovolené proměnné:/s;/s;%1, %FullFileName% - kompletní název souboru (vč. cesty a přípony)/s;%FileName% - pouze název souboru (bez cesty a přípony)/s;%FileExt% - přípona (bez tečky)/s;Proměnné nerozlišují malá a velká písmena

[SetupUnit]    ; setup window
0=OpenFileTC - nastavení
1=Jazyk:
2=Fonty a barvy
3=Zobrazení hlavním okně:
4=Vyberte požadovaný jazyk ze seznamu/s;Více jazykových mutací je dostupných na http://antoon-inc.com/oftc/
5=Sekce
6=Ikony
7=Seznam
8=Malé ikony
9=Report
10=Načítat ikony
11=Zobrazuje vlastní ikony programů
12=Použít
13=Použít vše
14=OK
15=Uložit změny a zavřít okno
16=Storno
17=Zavřít okno bez uložení změn
18=Samostatné nastavení pro každého uživatele
19=Použijte tuto volbu pro samostatné nastavení OpenFileTC/s;pro každého uživatele tohoto PC
20=Pokud tento soubor existuje, každý uživatel používá své vlastní nastavení programu OpenFileTC. Jestliže chcete používat stejné nastavení pro všechny uživatele smažte tento soubor. Tento komentář může být smazán.
21=Font...
22=Druh písma, velikost a barva pro text v hlavním okně
23=Pozadí
24=Barva pozadí hlavního okna
25=Ukládat ikony do mezipaměti
26=Načte ikony z programů pouze jednou/s;a uloží je do podsložky s ikonami (doporučeno)
27=Různé
28=Tuning
29=O programu
30=Vyberte druh zobrazení
31=Nesledovat programy
32=Nečekat, až běžící program dokončí práci s otevřeným souborem
33=Zobrazit podrobnosti u kurzoru myši
34=Standardně jsou podrobnosti o programu zobrazeny/s;v pravé části hlavního okna
35=Zobrazovat podrobnosti
36=Zobrazí podrobnosti o programech v hlavním okně,/s;pokud se na ně najede myší
37=Hlavní okno:
38=Dialogy:
39=Druh písma, velikost a barva pro texty v ostatních oknech
40=Seřadit položky v hlavním okně:
41=Vyberte způsob řazení položek v hlavním okně
42=Podle názvu
43=Podle počtu spuštění
44=Volba "Samostatné nastavení pro každého uživatele" bude aktivována po restartu OpenFileTC
45=Volby pro vynucené volání programu
46=Při zapnuté/stisknuté klávese:
47=Pokud je vybraná klávesa zapnuta/přidržena,/s; bude vždy zobrazeno hlavní okno OpenFileTC
48=Při umístění kurzoru myši v:
49=Pokud je kurzor myši ve vybraném rohu obrazovky,/s;bude vždy zobrazeno hlavní okno OpenFileTC
50=Vyberte polohu kurzoru myši ze seznamu
51=Vyberte klávesu ze seznamu
52=Levý horní roh obrazovky
53=Pravý horní roh obrazovky
54=Levý dolní roh obrazovky
55=Pravý dolní roh obrazovky
56=Zapnout podporu pro otevírání složek
57=Povolí otevření vybrané složky klávesou F4/s;Povolí proměnnou %Dir% jakou podporovanou příponu/s;Více informací viz soubor nápovědy OpenFileTC_*.chm
58=Stav políčka "Vždy použít vybraný program k otevření souboru tohoto typu":
59=Zde můžete nastavit výchozí stav zaškrtávacího políčka v hlavním okně,/s;který bude platný při každém spuštění OpenFileTC./s;Dostupné volby jsou "Vždy zapnuto", "Vždy vypnuto" a "Podle poslední volby"
60=Podle poslední volby
61=Vždy vypnuto
62=Vždy zapnuto
63=Přidat program do seznamu editorů, pokud na něm uživatel stiskne klávesu F4
64=Pokud se uživatel pokusí editovat EXE-soubor,/s;OpenFileTC se zeptá, zda má program přidat/s;do seznamu editorů
65=Domovská stránka:
66=Fórum:
67=Zobrazit nástrojovou lištu
68=Zobrazí nástrojovou lištu v hlavním okně
 ; new
69=Průhlednost
 ; new
70=Nastaví průhlednost pro všechna okna
 ; new
71=Pouze pro hlavní okno
 ; new
72=Nastaví průhlednost pouze pro hlavní okno OpenFileTC
 ; new
73=Vypnout pozadí hlavního okna
 ; new
74=Nastaví průhledné pozadí
 ; new
75=Vybrat program pod kurzorem myši
 ; new
76=Vybere/zvýrazní program pod kurzorem myši

[HotKeyUnit]    ; hot keys window
0=Klávesová zkratka
1=Nastavte klávesovou zkratku pro spouštění programu %ProgramName%
2=Nastavena kláves. zkratka:
3=Nová klávesová zkratka:
4=OK
5=Uložit změny a zavřít okno
6=Storno
7=Zavřít okno bez uložení změn
8=Ne
9=Klávesová zkratka je rezervovaná programem OpenFileTC
10=Klávesovou zkratku používá program %ProgramName%./s;Chcete ji nově nastavit pro %CurrProgramName% a odstranit pro předchozí program?

[ProgramSettingsUnit]    ; Window for settings of one selected executable
0=%ProgramName% vlastnosti
1=Název:
2=Cesta k programu:
3=Příkazový řádek (platné pro všechny přípony):
4=OpenFileTC nenalezl specifikovaný soubor/s;Prosím zkontrolujte zadanou cestu
5=Zadejte název programu zobrazený v hlavním okně
6=Plná cesta k programu
7=Vyberte soubor
8=Řešení problémů s otevíráním souborů
9=Žádný problém
10=Není problém s otvíráním více/s;souborů v tomto programu
11=Poslat programu pouze název prvního vybraného souboru BEZ uvozovek
12=Pošle programu jako parametr pouze název prvního vybraného souboru,/s;nikoliv kompletní seznam vybraných souborů, a to BEZ uvozovek
13=Poslat programu pouze název prvního vybraného souboru S uvozovkami
14=Pošle programu jako parametr pouze název prvního vybraného souboru,/s;nikoliv kompletní seznam vybraných souborů, a to S uvozovkami
15=Každý z vybraných souborů bude otevřen v samostatné instanci programu, název poslán S uvozovkami
16=Spustí požadovaný počet instancí programu,/s;každá obdrží, jako parametr, jeden název souboru ze seznamu./s;Název je poslán S uvozovkami./s;UPOZORNĚNÍ: V tomto případě přestane OpenFileTC sledovat programy  
17=Přípony...
18=Nastavení přípon pro tento program
19=OK
20=Uložit změny a zavřít okno
21=Storno
22=Zavřít okno bez uložení změn
23=Každý z vybraných souborů bude otevřen v samostatné instanci programu, název poslán BEZ uvozovek
24=Spustí požadovaný počet instancí programu,/s;každá obdrží, jako parametr, jeden název souboru ze seznamu./s;Název je poslán BEZ uvozovek./s;UPOZORNĚNÍ: V tomto případě přestane OpenFileTC sledovat programy  
25=Klepněte na obrázek pro výběr/s;ikony z jiného umístění
26=Vyberte soubor s ikonou
27=Uložit soubor jako...
28=Klávesová zkratka...
29=Nastavení klávesové zkratky pro výběr/s;programu z hlavního okna OpenFileTC
30=Sloučit příkazový řádek
31=Zadejte parametry do příkazového řádku. Parametry jsou platné pro všechny přípony asociované s tímto programem
32=Změnit ikonu
33=Uložit ikonu do souboru...
34=Vzhled okna po spuštění programu (funkčnost není garantována):
35=Výchozí
36=V normálním okně
37=Minimalizované 
38=Maximalizovaně
39=Otevřít všechny neznámé přípony tímto programem
40=Pokud OpenFileTC nenalezne asociaci pro vybranou/s;příponu, bude soubor otevřen tímto programem
; new
41=Nastavit tento příkazový řádek pro všechny podporované přípony vybraného editoru?

[FoundClipUnit]
0=Nalezena schránka
1=ID dat ve schránce: %BufferID%
2=Předdefinované typy:
3=Upozornění: schránka obsahuje nerozpoznaná data. Prosím, zkuste rozpoznat typ dat ve schránce. Použijte rozbalovací seznam výše.
4=Rozpoznat automaticky (experimentální funkce!)
5=Pokusit se rozpoznat datový typ automaticky (není doporučeno)
6=Výběr
7=Datový typ byl rozpoznán
8=Nenalezeno
9=Datový typ nebyl rozpoznán
10=Text ( ANSI )
11=Text ( OEM )
12=Text ( UNICODE )
13=Obrázek ( BMP )
14=Obrázek ( JPG )
15=Obrázek ( TIFF )
16=Metasoubor
17=Neznámý blok